# SketchedShapeNotAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SketchedShapeNotAvailable Property
BuiltInFailures..::..SketchFailures Class See Also
---
Skeched shape is not available for this type of element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchedShapeNotAvailable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchedShapeNotAvailable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchedShapeNotAvailable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace